{
  "\t": 99,
  "\n": 25,
  " ": 0,
  "!": 92,
  "\"": 58,
  "#": 100,
  "$": 122,
  "%": 86,
  "&": 77,
  "'": 66,
  "(": 40,
  ")": 39,
  "*": 87,
  "+": 93,
  ",": 22,
  "-": 38,
  ".": 23,
  "/": 50,
  "0": 61,
  "1": 54,
  "2": 62,
  "3": 65,
  "4": 69,
  "5": 70,
  "6": 71,
  "7": 75,
  "8": 68,
  "9": 76,
  ":": 49,
  ";": 55,
  "<": 163,
  "=": 94,
  ">": 95,
  "?": 74,
  "@": 72,
  "A": 30,
  "B": 56,
  "C": 33,
  "D": 36,
  "E": 35,
  "F": 46,
  "G": 53,
  "H": 51,
  "I": 29,
  "J": 82,
  "K": 73,
  "L": 48,
  "M": 47,
  "N": 45,
  "O": 34,
  "P": 28,
  "Q": 81,
  "R": 41,
  "S": 27,
  "T": 31,
  "U": 37,
  "V": 59,
  "W": 32,
  "X": 80,
  "Y": 44,
  "Z": 89,
  "[": 96,
  "\\": 132,
  "]": 97,
  "^": 107,
  "_": 85,
  "a": 6,
  "b": 21,
  "c": 9,
  "d": 12,
  "e": 1,
  "f": 17,
  "g": 18,
  "h": 13,
  "i": 4,
  "j": 60,
  "k": 26,
  "l": 11,
  "m": 15,
  "n": 7,
  "o": 2,
  "p": 16,
  "q": 43,
  "r": 5,
  "s": 8,
  "t": 3,
  "u": 10,
  "v": 19,
  "w": 20,
  "x": 42,
  "y": 14,
  "z": 52,
  "|": 120,
  "\u00a0": 24,
  "\u00a7": 101,
  "\u00a9": 103,
  "\u00ad": 108,
  "\u00ae": 91,
  "\u00b7": 78,
  "\u00bb": 102,
  "\u00c2": 126,
  "\u00c4": 164,
  "\u00c7": 125,
  "\u00ca": 144,
  "\u00d1": 159,
  "\u00d5": 160,
  "\u00dc": 136,
  "\u00df": 156,
  "\u00e0": 109,
  "\u00e1": 135,
  "\u00e3": 130,
  "\u00e4": 115,
  "\u00e7": 114,
  "\u00e8": 143,
  "\u00e9": 98,
  "\u00ed": 131,
  "\u00f1": 117,
  "\u00f3": 119,
  "\u00f6": 112,
  "\u00f8": 141,
  "\u00fc": 110,
  "\u014d": 124,
  "\u01cb": 162,
  "\u01cc": 137,
  "\u01cd": 154,
  "\u01ce": 157,
  "\u037e": 134,
  "\u0438": 155,
  "\u0439": 139,
  "\u043a": 151,
  "\u0440": 142,
  "\u0441": 129,
  "\u0443": 145,
  "\u2011": 121,
  "\u2013": 79,
  "\u2014": 83,
  "\u2018": 90,
  "\u2019": 57,
  "\u201c": 64,
  "\u201d": 63,
  "\u201e": 123,
  "\u2022": 84,
  "\u2028": 67,
  "\u202f": 128,
  "\u203a": 105,
  "\u2120": 147,
  "\u2122": 106,
  "\u2139": 113,
  "\u2212": 116,
  "\u25cf": 88,
  "\u4e2d": 152,
  "\u6000": 158,
  "\u6040": 140,
  "\u6587": 153,
  "\u7ffb": 149,
  "\u9210": 148,
  "\ubead": 161,
  "\ucec0": 150,
  "\ue014": 133,
  "\ue045": 127,
  "\ue2e0": 146,
  "\uf500": 138,
  "\ufb00": 111,
  "\ufb01": 104,
  "\ufb03": 118
}